// Задача 60. ...Сформируйте трёхмерный массив из неповторяющихся двузначных чисел. Напишите программу, которая будет построчно выводить массив, добавляя индексы каждого элемента.
// Массив размером 2 x 2 x 2
// 66(0,0,0) 25(0,1,0)
// 34(1,0,0) 41(1,1,0)
// 27(0,0,1) 90(0,1,1)
// // 26(1,0,1) 55(1,1,1)

int[,,] arrayX3 = {{{10, 11, 12},{13, 14, 15},{16, 17, 18}}, {{19,20,21},{22, 23, 24},{25, 26, 27}}, {{28, 29, 30},{31, 32, 33},{34, 35, 36}}};

void PrintArray(int[,,] array){

    for (int i = 0; i < array.GetLength(0); i++)
    {
        for (int j = 0; j < array.GetLength(1); j++)
        {
            for (int k = 0; k < array.GetLength(2); k++)
            {
                Console.Write($"{array[i,j,k]}({i} {j} {k})");
            }
            Console.WriteLine();
        }
         Console.WriteLine();
    }
}
PrintArray(arrayX3);